In [1]:
import pandas as pd

Here, you're going to fire up your very first SQL engine. You'll create an engine to connect to the SQLite database `'Chinook.sqlite'`

Here, `"sqlite:///Chinook.sqlite"` is called the `connection string` to the `SQLite database Chinook.sqlite`

In [21]:
# Import necessary module
from sqlalchemy import create_engine

# Create engine: engine
engine = create_engine("sqlite:///Chinook.sqlite")

### Ex 1:

In this exercise, you'll once again create an engine to connect to `'Chinook.sqlite'`. Before you can get any data out of the database, however, you'll need to know what `tables` it contains!

To this end, you'll save the `table names` to a `list` using the method `table_names()` on the engine and then you will print the list.

In [22]:
# Import the function create_engine from the module sqlalchemy
from sqlalchemy import create_engine

# Create an engine to connect to the SQLite database 'Chinook.sqlite' and assign it to engine.
engine = create_engine("sqlite:///Chinook.sqlite")

# Using the method table_names() on the engine engine, assign the table names of 'Chinook.sqlite' to the variable table_names.
table_names = engine.table_names()

# Print the table names to the shell
print(table_names)

['Album', 'Artist', 'Customer', 'Employee', 'Genre', 'Invoice', 'InvoiceLine', 'MediaType', 'Playlist', 'PlaylistTrack', 'Track']

<ipython-input-22-3e3a234ef054>:8: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  table_names = engine.table_names()

In [23]:
## Query : Getting Data out from the Database

## To return all the columns of the table we use "SELECT" and "FROM"
 
## SELECT * FROM Table_Name ---->> It'll return all the columns of all rows of the table

### Work flow of SQL querying

### EX 2:

Now, it's time for liftoff! In this exercise, you'll perform the Hello World of SQL queries, `SELECT`, in order to `retrieve all columns` of the table `Album` in the `Chinook database`. Recall that the query `SELECT *` selects `all columns`.

In [2]:
# Import packages and functions

from sqlalchemy import create_engine
import pandas as pd

# Create the database engine
engine = create_engine("sqlite:///Chinook.sqlite")

# Connect to the engine
# Open the engine connection as con using the method connect() on the engine.
con = engine.connect()

# Query the database
# Execute the query that selects ALL columns from the Album table. Store the results in rs.
rs = con.execute('SELECT * FROM Employee')

# Save query results to a DataFrame df by applying the fetchall() method
df = pd.DataFrame(rs.fetchall())

# Using the rs object, set the DataFrame's column names to the corresponding names of the table columns.
df.columns = rs.keys()

# Close the connection
con.close()

# Print head of DataFrame df
print(df.head())

   EmployeeId LastName FirstName                Title  ReportsTo  \
0           1    Adams    Andrew      General Manager        NaN
1           2  Edwards     Nancy        Sales Manager        1.0
2           3  Peacock      Jane  Sales Support Agent        2.0
3           4     Park  Margaret  Sales Support Agent        2.0
4           5  Johnson     Steve  Sales Support Agent        2.0

             BirthDate             HireDate              Address      City  \
0  1962-02-18 00:00:00  2002-08-14 00:00:00  11120 Jasper Ave NW  Edmonton
1  1958-12-08 00:00:00  2002-05-01 00:00:00         825 8 Ave SW   Calgary
2  1973-08-29 00:00:00  2002-04-01 00:00:00        1111 6 Ave SW   Calgary
3  1947-09-19 00:00:00  2003-05-03 00:00:00     683 10 Street SW   Calgary
4  1965-03-03 00:00:00  2003-10-17 00:00:00         7727B 41 Ave   Calgary

  State Country PostalCode              Phone                Fax  \
0    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
1    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2    AB  Canada    T2P 5M5  +1 (403) 262-3443  +1 (403) 262-6712
3    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
4    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543

                      Email
0    andrew@chinookcorp.com
1     nancy@chinookcorp.com
2      jane@chinookcorp.com
3  margaret@chinookcorp.com
4     steve@chinookcorp.com

### Customizing the SQL Queries

Now you're going to figure out how to customize your query in order to:

1.Select `specified columns` from a table;

2.Select a `specified number of rows`;

3.Import `column names` from the database table.

In [3]:
## By Using the context manager "with" we no longer need to worry about closing the connection

# The engine connection can be opened with the statement---
with engine.connect() as con:
    # We can Select specified columns from a table instead of all the columns
    # Execute the SQL query that selects the columns LastName and Title from the Employee table.
    # Store the results in the variable rs.
    rs = con.execute("SELECT LastName, Title FROM Employee")
    
    # We can use fetchmany() method to Select a specified number of rows instead of fetching all the rows
    # Apply the method fetchmany() to rs in order to retrieve 3 of the records. Store them in the DataFrame df
    df = pd.DataFrame(rs.fetchmany(size = 3))
    
    # Using the rs object, set the DataFrame's column names to the corresponding names of the table columns.
    df.columns = rs.keys()

In [4]:
# Print the length of the DataFrame df
print(len(df))

# Print the head of the DataFrame df
print(df.head())

3
  LastName                Title
0    Adams      General Manager
1  Edwards        Sales Manager
2  Peacock  Sales Support Agent

### Filtering your database records using SQL's WHERE

There are a couple more standard SQL query chops that will aid you in your journey to becoming an SQL ninja.

Let's say, for example that you wanted to get all records from the `Customer` table of the `Chinook database` for which the `Country` is `'Canada'`. You can do this very easily in SQL using a `SELECT` statement followed by a `WHERE` clause as follows:

`SELECT * FROM Customer WHERE Country = 'Canada'`

in fact, you can `filter` any `SELECT` statement by `any condition` using a `WHERE` clause. This is called `filtering your records.`

### Ex 3:

In this interactive exercise, you'll `select` all records of the `Employee` table for which `'EmployeeId'` is `greater than or equal to 6.`

In [7]:
# Complete the argument of create_engine() so that the engine for the SQLite database 'Chinook.sqlite' is created.
engine = create_engine("sqlite:///Chinook.sqlite")

# Open engine in context manager
with engine.connect() as con:

    # Execute the query that selects all records from the Employee table where 'EmployeeId' is greater than or equal to 6.
    # Use the >= operator and assign the results to rs.
    rs = con.execute("SELECT * FROM Employee WHERE EmployeeId >= 6")
    
    # Apply the method fetchall() to rs in order to fetch all records in rs. Store them in the DataFrame df.
    df = pd.DataFrame(rs.fetchall())
    
    # Using the rs object, set the DataFrame's column names to the corresponding names of the table columns.
    df.columns = rs.keys()

# Print the head of the DataFrame df
print(df.head())

   EmployeeId  LastName FirstName       Title  ReportsTo            BirthDate  \
0           6  Mitchell   Michael  IT Manager          1  1973-07-01 00:00:00
1           7      King    Robert    IT Staff          6  1970-05-29 00:00:00
2           8  Callahan     Laura    IT Staff          6  1968-01-09 00:00:00

              HireDate                      Address        City State Country  \
0  2003-10-17 00:00:00         5827 Bowness Road NW     Calgary    AB  Canada
1  2004-01-02 00:00:00  590 Columbia Boulevard West  Lethbridge    AB  Canada
2  2004-03-04 00:00:00                  923 7 ST NW  Lethbridge    AB  Canada

  PostalCode              Phone                Fax                    Email
0    T3B 0C5  +1 (403) 246-9887  +1 (403) 246-9899  michael@chinookcorp.com
1    T1K 5N8  +1 (403) 456-9986  +1 (403) 456-8485   robert@chinookcorp.com
2    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772    laura@chinookcorp.com

### Ordering your SQL records with ORDER BY

You can also `order` your SQL query results. For example, if you wanted to get all records from the `Customer` table of the `Chinook database` and order them `in increasing order` by the column `SupportRepId`, you could do so with the following query:

`"SELECT * FROM Customer ORDER BY SupportRepId"`

In fact, you can `order` `any SELECT` statement by `any column`.


### Ex 4:

In this interactive exercise, you'll `select` all records of the `Employee` table and `order` them in `increasing order` by the column `BirthDate`.

In [8]:
# Using the function create_engine(), 
# create an engine for the SQLite database Chinook.sqlite and assign it to the variable engine.
engine = create_engine("sqlite:///Chinook.sqlite")

# Open engine in context manager 
with engine.connect() as con:
    
    # execute the query that selects all records from the Employee table 
    # and orders them in increasing order by the column BirthDate. Assign the result to rs.
    rs = con.execute("SELECT * FROM Employee ORDER BY BirthDate")
    
    # In a call to pd.DataFrame(), apply the method fetchall() to rs in order to fetch all records in rs. 
    # Store them in the DataFrame df.
    df = pd.DataFrame(rs.fetchall())

    # Set the DataFrame's column names to the corresponding names of the table columns.
    df.columns = rs.keys()

# Print head of DataFrame
print(df.head())

   EmployeeId  LastName FirstName                Title  ReportsTo  \
0           4      Park  Margaret  Sales Support Agent        2.0
1           2   Edwards     Nancy        Sales Manager        1.0
2           1     Adams    Andrew      General Manager        NaN
3           5   Johnson     Steve  Sales Support Agent        2.0
4           8  Callahan     Laura             IT Staff        6.0

             BirthDate             HireDate              Address        City  \
0  1947-09-19 00:00:00  2003-05-03 00:00:00     683 10 Street SW     Calgary
1  1958-12-08 00:00:00  2002-05-01 00:00:00         825 8 Ave SW     Calgary
2  1962-02-18 00:00:00  2002-08-14 00:00:00  11120 Jasper Ave NW    Edmonton
3  1965-03-03 00:00:00  2003-10-17 00:00:00         7727B 41 Ave     Calgary
4  1968-01-09 00:00:00  2004-03-04 00:00:00          923 7 ST NW  Lethbridge

  State Country PostalCode              Phone                Fax  \
0    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
1    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
3    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543
4    AB  Canada    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772

                      Email
0  margaret@chinookcorp.com
1     nancy@chinookcorp.com
2    andrew@chinookcorp.com
3     steve@chinookcorp.com
4     laura@chinookcorp.com

###  Relationships between tables: INNER JOIN

To `INNER JOIN` the `Orders` and `Customers` tables from the `Northwind database`, Hugo executed the following SQL query:

`"SELECT OrderID, CompanyName FROM Orders INNER JOIN Customers on Orders.CustomerID = Customers.CustomerID"`

### Ex 5:

Here, you'll perform your first `INNER JOIN`! You'll be working with your favourite SQLite database, `Chinook.sqlite`. For each record in the `Album` table, you'll extract the `Title` along with the `Name` of the Artist. The latter will come from the `Artist` table and so you will need to `INNER JOIN` these two tables on the `ArtistID` column of both.

In [10]:
# Open engine in context manager
with engine.connect() as con:
    
    # Assign to rs the results from the following query: 
    # 'select' all the records, extracting the 'Title' of the record and 'Name' of the artist of each record
    # 'from' the 'Album' table and the 'Artist' table, respectively--
    # 'INNER JOIN' these two tables on the 'ArtistID' column of both.
    rs = con.execute("SELECT Title, Name FROM Album INNER JOIN Artist on Album.ArtistID = Artist.ArtistID")
    
    # In a call to pd.DataFrame(), apply the method fetchall() to rs in order to fetch all records in rs
    # Store them in the DataFrame df and set the DataFrame's column names to the corresponding names of the table columns.
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

# Print head of DataFrame df
print(df.head())

                                   Title       Name
0  For Those About To Rock We Salute You      AC/DC
1                      Balls to the Wall     Accept
2                      Restless and Wild     Accept
3                      Let There Be Rock      AC/DC
4                               Big Ones  Aerosmith